system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr 2;
        nAlphaSubCycles 1;
        cAlpha 1;
        icAlpha 0;

        MULESCorr yes;
        nLimiterIter 10;
        alphaApplyPrevCorr yes;

        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-8;
        relTol 0;
        minIter 1;

        // interIsoFoam
        isoFaceTol 1e-10;
        surfCellTol 1e-6;
        nAlphaBounds 3;
        snapTol 1e-12;
        clip true;
        writeSurfCells false;
        writeBoundedCells false;
        writeIsoFaces false;
        reconstructionScheme plicRDF; // isoAlpha

        // nAlphaSubCycles 1;
        // cAlpha 1; // Read by interIsoFoam but not used
    }

    "pcorr.*"
    {
        solver PCG;
        preconditioner
        {
            preconditioner GAMG;
            smoother GaussSeidel;
            tolerance 1e-5;
            relTol 0;
        };
        tolerance 1e-5;
        relTol 0;
    };

    p_rgh
    {
        solver GAMG;
        smoother DIC;
        tolerance 1e-7;
        relTol 0.01;
    };

    p_rghFinal
    {
        $p_rgh;
        relTol 0;
    }

    "(U|k|omega).*"
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        nSweeps 1;
        tolerance 1e-7;
        relTol 0.1;
        minIter 1;
    };
}

PIMPLE
{
    momentumPredictor no;

    nOuterCorrectors 1;
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;

    // maxCo 10;
    // maxAlphaCo 5;

    // maxCo 0.5;
    // maxAlphaCo 0.5;

    rDeltaTSmoothingCoeff 0.05;
    rDeltaTDampingCoeff 0.5;
    nAlphaSpreadIter 0;
    nAlphaSweepIter 0;
    maxDeltaT 1;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
